#include <cmath>
#include <iostream>
#include <vector>

using namespace std;

vector<vector<long long>> pow2(vector<vector<long long>> M, int N, long long mod) {
    vector<vector<long long>> R(N, vector<long long>(N));
    for (int n = 0; n < N; ++n) {
        for (int m = 0; m < N; ++m) {
            for (int k = 0; k < N; ++k) {
                R[n][k] += (M[n][m] % mod) * (M[m][k] % mod) % mod;
            }
        }
    }

    return R;
}

vector<vector<long long>> calc(vector<vector<long long>> M1, vector<vector<long long>> M2, int N, long long mod) {
    vector<vector<long long>> R(N, vector<long long>(N));
    for (int n = 0; n < N; ++n) {
        for (int m = 0; m < N; ++m) {
            for (int k = 0; k < N; ++k) {
                R[n][k] += (M1[n][m] % mod) * (M2[m][k] % mod) % mod;
            }
        }
    }

    return R;
}

vector<vector<long long>> dfs(vector<vector<long long>> M1, long long B, long long mod, int N) {
    if (B == 1) {
        for (int i = 0; i < N; ++i) {
            for (int j = 0; j < N; ++j) {
                M1[i][j] %= mod;
            }
        }

        return M1;
    }

    vector<vector<long long>> half = dfs(M1, B / 2, mod, N);
    if (B % 2 == 1) {
        return calc(pow2(half, N, mod), M1, N, mod);
    } else {
        return pow2(half, N, mod);
    }
}

int main(void) {
    ios::sync_with_stdio(false);
    cin.tie(NULL);
    cout.tie(NULL);

    long long N;
    cin >> N;

    switch (N) {
    case 0:
        cout << 0 << "\n";
        return 0;
    case 1:
        cout << 1 << "\n";
        return 0;
    case 2:
        cout << 1 << "\n";
        return 0;
    default:
        break;
    }

    vector<vector<long long>> init(2, vector<long long>(2));
    init[0][0] = 1;
    init[0][1] = 1;
    init[1][0] = 1;
    init[1][1] = 0;
    vector<vector<long long>> M1 = dfs(init, N - 1, 1'000'000'007, 2);
    vector<vector<long long>> M2(2, vector<long long>(1));
    M2[0][0] = 1;
    M2[1][0] = 0;

    vector<vector<long long>> R = calc(M1, M2, 2, 1'000'000'007);
    R[0][0] %= 1'000'000'007;
    R[1][0] %= 1'000'000'007;

    cout << R[0][0] << "\n";

    return 0;
}

/*
    밑에는 개소리니 무시..
    아이디어는 행렬을 도입하는 것.
    [Fn+1    [[1 1]    [Fn
     Fn  ] =  [1 0]] *  Fn-1] 점화식을 이용하는 것이다.
    이 점화식의 해를 풀어보면 다음과 같다.
    [Fn+1    [[1 1]^n   [1
     Fn  ] =  [1 0]]  *  0] 즉 행렬의 거듭제곱으로 풀어야 하는 것이다.
*/
/*
    Fn = Fn-1 + Fn-2
    Fn-1 = Fn-2 + Fn-3
    Fn-2 = Fn-3 + Fn-4
    Fn-3 = Fn-4 + Fn-5
    ...
    1 = 1 + 0

    Fn = 2Fn-2 + Fn-3
       = Fn-2 + 2Fn-3 + Fn-4
       = Fn-2 + Fn-3 + 2Fn-4 + Fn-5
       ...
       = Fn-2 + Fn-3 + Fn-4 + Fn-5 + Fn-6 + .. + 2 + 1 + 2

    0
    1
    1
    2 = 1 * 2 - 0
    3 = 2 * 2 - 1 = (1 * 2^2 - 0) - 1
                  = 2^2 - 2^0
    5 = 3 * 2 - 1 = (1 * 2^3 - 0) - 2 - 1
                  = 2^3 - 2^1 - 2^0
    8 = 5 * 2 - 2 = (1 * 2^4 - 0) - 2^2 - 2 - (1 * 2 - 0)
                  = 2^4 - 2^2 - 2^1 - 2^1
    13 = 8 * 2 - 3 = (1 * 2^5 - 0) - 2^3 - 2^2 - (1 * 2^2 - 0) - (1 * 2^2 - 0 - 1)
                   = 2^5 - 2^3 - 2^2 - 2^2 - 2^2 + 1
                   = 2^5 - 2^3 - 2^2 - 2^2 - (2^2 - 2^0)
                   = 2^5 - 2^3 - 2^2 - 2^2 - 2^2 + 2^0
                   = 2^5 - 2^3 - 3(2^2) + 2^0
    21 = 13 * 2 - 5 = (1 * 2^6 - 0) - 2^4 - 2^3 - (1 * 2^3 - 0) - (1 * 2^3 - 2) - ((1 * 2^3 - 0) - 2 - 1)
                    = 2^6 - 2^4 - 2^3 - 2^3 - 2^3 - 2^3 + 2 + 2 + 1
                    = 2^6 - 2^4 - 4(2^3) + 5
                    = 2^6 - 2^4 - 2^3 - 2^3 - 2^3 + 2^1 - (2^3 - 2^1 - 2^0)
                    = 2^6 - 2^4 - 2^3 - 2^3 - 2^3 + 2^1 - 2^3 + 2^1 + 2^0
                    = 2^6 - 2^4 - 4(2^3) + 2^1 + 2^1 + 2^0
                    = 2^6 - 2^4 - 4(2^3) + 2(2^1) + 2^0
    34 = 21 * 2 - 8 = 2^7 - 2^5 - 4(2^4) + 10 - (2^4 - 2^2 - 2(2^1))
                    = 2^7 - 2^5 - 5(2^4) + 18
                    = 2^7 - 2^5 - 2^4 - 2^4 - 2^4 + 2^2 - 2^4 + 2^2 + 2^1 - (2^4 - 2^2 - 2^1 - 2^1)
                    = 2^7 - 2^5 - 2^4 - 2^4 - 2^4 + 2^2 - 2^4 + 2^2 + 2^1 - 2^4 + 2^2 + 2^1 + 2^1
                    = 2^7 - 2^5 - 5(2^4) + 2^2 + 2^2 + 2^1 + 2^2 + 2^1 + 2^1
                    = 2^7 - 2^5 - 5(2^4) + 3(2^2) + 3(2^1)
    55 = 34 * 2 - 13 = 2^8 - 2^6 - 5(2^5) + 36 - (2^5 - 2^3 - 3(2^2) + 1)
                     = 2^8 - 2^6 - 6(2^5) + 55
                     = 2^8 - 2^6 - 5(2^5) + 3(2^3) + 3(2^2) - (2^5 - 2^3 - 3(2^2) + 2^0)
                     = 2^8 - 2^6 - 6(2^5) + 4(2^3) + 6(2^2) - 2^0
    89 = 55 * 2 - 21 = 2^9 - 2^7 - 6(2^6) + 4(2^4) + 6(2^3) - 2^1 - (2^6 - 2^4 - 4(2^3) + 2(2^1) + 2^0)
                     = 2^9 - 2^7 - 7(2^6) + 5(2^4) + 10(2^3) - 3(2^1) - 2^0
    144 = 89 * 2 - 34 = 2^10 - 2^8 - 7(2^7) + 5(2^5) + 10(2^4) - 3(2^2) - 2^1 - (2^7 - 2^5 - 5(2^4) + 3(2^2) + 3(2^1))
                      = 2^10 - 2^8 - 8(2^7) + 6(2^5) + 15(2^4) - 6(2^2) - 4(2^1)
    233 = 144 * 2 - 55 = 2^11 - 2^9 - 8(2^8) + 6(2^6) + 15(2^5) - 6(2^3) - 4(2^2) - (2^8 - 2^6 - 6(2^5) + 4(2^3) + 6(2^2) - 2^0)
                       = 2^11 - 2^9 - 9(2^8) + 7(2^6) + 21(2^5) - 10(2^3) - 10(2^2) + 2^0
    377 = 233 * 2 - 89 = 2^12 - 2^10 - 9(2^9) + 7(2^7) + 21(2^6) - 10(2^4) - 10(2^3) + 2^1 - (2^9 - 2^7 - 7(2^6) + 5(2^4) + 10(2^3) - 3(2^1) - 2^0)
                       = 2^12 - 2^10 - 10(2^9) + 8(2^7) + 28(2^6) - 15(2^4) - 20(2^3) + 4(2^1) + 2^0
    610 = 377 * 2 - 144
    987 = 610 * 2 - 233
    1597 = 987 * 2 - 377 = 987 * 2 - (233 * 2 - (55 * 2 - (13 * 2 - (3 * 2 - 1))))
    ..

    Fn = Fn-1 * 2 - Fn-3
       = (Fn-2 * 2 - Fn-4) * 2 - Fn-3
       = ((Fn-3 * 2 - Fn-5) * 2 - Fn-4) * 2 - Fn-3
*/